'''. У вас есть список имён:
# names = ('Максат','Лязат','Данияр','Айбек','Атай','Салават','Адинай','Жоомарт','Алымбек','Эрмек','Дастан','Бекмамат','Аслан',)
# Если первое имя = 0, второе имя = 1 и т.д.
# Выведите на экран всё имена которые лежат на чётных числах'''


names = ('Maks','lyazat','dani','aiba','atai','salavat','adinai','Жоомарт','Алымбек','Эрмек','Дастан','Бекмамат','Аслан','gektar')
for i in range(len(names)):
	break
print (names [i:16:2], end = ' ')
