3
numbers = [1,2,3,4,5,6,7,8,9]
# Выведите первый, последний и средний элемент списка.

print (numbers[0:9:4])
